---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointSizeMismatch
source: html/2ec0c02b-5289-6a0c-fff4-865cc4c8e7e5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointSizeMismatch Property

The element has a connector with a fitting joint size mismatch

## Syntax (C#)
```csharp
public static FailureDefinitionId JointSizeMismatch { get; }
```